# Start Pandas

In [1]:
%matplotlib inline
import pandas as pd

In [3]:
# limiting the display rows
pd.set_option('display.max_rows', 5)

In [4]:
data = pd.read_csv('data//GameSalary.csv')
data

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good
...,...,...,...,...,...,...,...,...
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent
92,27474,Elway,William,M,Programming,Programmer,75000,Good

In [6]:
# Display first five records
data.head()
data.head(2)

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good

In [7]:
# rows, columns
data.shape

(93, 8)

In [8]:
# show columns
data.columns

Index(['ID', 'Last Name', 'First Name', 'Gender', 'Department', 'Title',
       'Salary', 'Performance'],
      dtype='object')

In [9]:
# Statistics summary
data.describe()

                 ID         Salary
count     93.000000      93.000000
mean   19267.075269   62346.182796
...             ...            ...
75%    23484.000000   70125.000000
max    27474.000000  120000.000000

[8 rows x 2 columns]

In [10]:
data

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good
...,...,...,...,...,...,...,...,...
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent
92,27474,Elway,William,M,Programming,Programmer,75000,Good

In [17]:
# display single column
res = data['Last Name']
res = data['Salary']
res = data.Salary   # for column name without space
#res = data.Last Name  #<- error

print(data.Salary)
data

0     67000
1     80000
      ...
91    90000
92    75000
Name: Salary, Length: 93, dtype: int64

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good
...,...,...,...,...,...,...,...,...
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent
92,27474,Elway,William,M,Programming,Programmer,75000,Good

In [23]:
# Select unique value
print(data.Department)
print(data.Department.unique())
print(len(data.Department.unique()))

0     Sound Design
1        Animation
          ...
91     Programming
92     Programming
Name: Department, Length: 93, dtype: object
['Sound Design' 'Animation' 'Art' 'Programming' 'Game Design'
 'Quality Assurance' 'Production']
7

# Selection

In [24]:
# what is output
data['ID']

0     10000
1     10387
      ...
91    27244
92    27474
Name: ID, Length: 93, dtype: int64

In [25]:
# display mutiple columns
# Show first name, last name and title, , use [[]]!!!
data[['Last Name', 'First Name', 'Title']]

   Last Name First Name                  Title
0     Aikman       Gary  Senior Sound Designer
1     Felser    Cynthia          Lead Animator
..       ...        ...                    ...
91  De Maria     Cristi             Programmer
92     Elway    William             Programmer

[93 rows x 3 columns]

In [28]:
# Use .loc[]

# select first record
res = data.loc[0]
print(res)
print('------')

# select single column, first record
res = data.loc[0,'Last Name']
print(res)
print('------')

res = data['Last Name'].loc[0]
print(res)
print('------')

ID               10000
Last Name       Aikman
                ...
Salary           67000
Performance    Average
Name: 0, Length: 8, dtype: object
------
Aikman
------
Aikman
------

In [31]:
print('------')
res = data[['ID','Last Name','First Name']]
print(res)

res = data.loc[0,['ID','Last Name','First Name']]
print(res)


print('------')
res = data[['ID','Last Name','First Name']].iloc[0]
print(res)

print('------')
res = data[['ID','Last Name','First Name']].iloc[:5]
print(res)

------
       ID Last Name First Name
0   10000    Aikman       Gary
1   10387    Felser    Cynthia
..    ...       ...        ...
91  27244  De Maria     Cristi
92  27474     Elway    William

[93 rows x 3 columns]
ID             10000
Last Name     Aikman
First Name      Gary
Name: 0, dtype: object
------
ID             10000
Last Name     Aikman
First Name      Gary
Name: 0, dtype: object
------
      ID Last Name First Name
0  10000    Aikman       Gary
1  10387    Felser    Cynthia
2  10552    Leslie       Jean
3  10936     Cusak    Barbara
4  11048     Noble      Linda

In [ ]:
# Add a new member to the dataframe
# Check https://stackoverflow.com/questions/49916371/how-to-append-new-row-to-dataframe-in-pandas
# list
new =['99999','Smith','Joe','M','Animation','Senior Programmer',75000,'Good','Chicago']
data.loc[len(data)] = new


data.tail()

In [34]:
data

,ID,Last Name,First Name,Gender,Department,Title,Salary,Performance
0,10000,Aikman,Gary,F,Sound Design,Senior Sound Designer,67000,Average
1,10387,Felser,Cynthia,F,Animation,Lead Animator,80000,Good
...,...,...,...,...,...,...,...,...
91,27244,De Maria,Cristi,F,Programming,Programmer,90000,Excellent
92,27474,Elway,William,M,Programming,Programmer,75000,Good

In [36]:
# only show one column

names = data['Last Name']  # this is a series
names

0       Aikman
1       Felser
        ...
91    De Maria
92       Elway
Name: Last Name, Length: 93, dtype: object

In [37]:
data['Last Name'].index

RangeIndex(start=0, stop=93, step=1)

In [38]:
data['Last Name'].values

array(['Aikman', 'Felser', 'Leslie', 'Cusak', 'Noble', 'Bobbitt',
       'Lobree', 'Sampieri', 'Powell', 'Cole', 'Foerster', 'Guilford',
       'Drubin', 'Spinale', 'Watson', 'Pennekamp', 'Fegin', 'Erpf',
       'White', 'Jones', 'Jackson', 'Hood', 'Moss', 'Wilson', 'Ross',
       'Martin', 'Scott', 'Park', 'Gonzalez', 'Wynperle', 'Wood', 'Hasty',
       'North', 'Parker', 'Brawner', 'Fleming', 'Sade', 'Stieglitz',
       'Munroe', 'Mills', 'Voell', 'Titley', 'Brett', 'Shuffield',
       'Brickey', 'Mosely', 'Dill', 'Reed', 'Evans', 'Brooks', 'Strump',
       'Payne', 'Lazarus', 'Jenks', 'Rapee', 'Gander', 'Restery', 'Park',
       'Halloway', 'Moran', 'Shindell', 'Sapp', 'Rudy', 'Anderson',
       'Afflord', 'Quinton', 'Justice', 'Jamison', 'Johnson', 'Simon',
       'Munter', 'Williamson', 'Smith', 'Moynahan', 'Bogani', 'Holly',
       'Goldstein', 'Figure', 'Adams', 'Carlo', 'Hoffman', 'Scola',
       'Mason', 'Fischler', 'Munroe', 'Houston', 'Pawley', 'Rodriguez',
       'Whiting', 'Denver', 'Bermont', 'De Maria', 'Elway'], dtype=object)

In [41]:
print(data.ID)
print('------')
# Total employees, use count
print(data['ID'].count())
print('------')
# also can use len
len(data['ID'])

0     10000
1     10387
      ...
91    27244
92    27474
Name: ID, Length: 93, dtype: int64
------
93
------

93

# Filtering

In [ ]:
data[data['Gender']=='F']

In [ ]:
# Use filter, 
males = data[data['Gender']=='M']
print(males.shape)
print(data.shape)

In [ ]:
# 'Title' vs. data.Title
res = data[data.Title=='Programmer']
print(len(res))

# vs.
res = data[data['Title']=='Programmer']
print(len(res))

print(res['Title'])

In [ ]:
# List all Female Senior Game Designer
data[(data['Title'] =='Senior Programmer') & (data['Gender'] =='F')]

In [ ]:
# List all Female Senior Game Designer
data[(data['Title'] =='Senior Programmer') | (data['Gender'] =='F')]

In [ ]:
# List senior position or performance is Excellent
# Use contains
df = data

df = df[ (df.Title.str.contains('Senior')) | (df.Performance=='Exellent')]
df

In [ ]:
# Or
df = data
df= df[ (df.Title=='Senior Programmer') & (df.Gender=='F')]
# How many people satisfied the condition
df.ID.count()

In [ ]:
df.iloc[0]

#Use .loc to assign column values

In [ ]:
len(data[data.Performance=='Excellent'])

# Sorting

df.sort_values(by=['a','b'])

In [ ]:
#df.sort_values?
df.sort_values(by = 'Salary',ascending=False).head()

In [ ]:

data.sort_values(by=['Gender','Salary'],ascending = False)

In [ ]:
#df.sort_values?

In [ ]:
df.sort_values(by='Last Name',ascending = False)

In [ ]:
# List top three who has the Highest Salary
res = df.sort_values(by='Salary',ascending = False).head(3)
res

In [ ]:
res = df.sort_values(by=['Title','Salary'],ascending = False).head(20)
res

In [ ]:
# List three famaleiprogrammer who have the lowest sarlary

res1 = df[(df.Gender=='F') & (df.Title=='Programmer')].sort_values(by ='Salary').tail(3)

res2 = df[(df.Gender=='M') & (df.Title=='Programmer')].sort_values(by ='Salary').tail(3)

print(res1)
print(res2)